In [20]:
import pandas as pd
data = [[1, 100]]
employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

In [51]:
pd.DataFrame([employee[employee.salary != employee.salary.max()].salary.max()]
             ,columns=['SecondHighestSalary']).fillna('null')

  SecondHighestSalary
0                null

In [52]:
pd.DataFrame([employee[employee.salary != employee.salary.max()].salary.max()]
             ,columns=['SecondHighestSalary'])

   SecondHighestSalary
0                  NaN

In [70]:
newsalary = employee.sort_values(by='salary',ascending=False).drop_duplicates(
    subset='salary',
    keep='first'
)

In [71]:
newsalary

   id  salary
0   1     100

In [90]:
if employee['salary'].nunique() < 2:
    pd.DataFrame({'SecondHighestSalary':[pd.NA]})
else:
    p = newsalary.iloc[1]['salary']
    pd.DataFrame({'SecondHighestSalary':[p]})

In [83]:
pd.DataFrame([pd.NA],columns = ['SecondHighestSalary'])

  SecondHighestSalary
0                <NA>

In [87]:
p = newsalary.iloc[0]['salary']

100